// *****************************************************************************
//  版权所有  (C) 2015,  硅格半导体有限公司 
//   
//  文件名称：  ata_general.h
//  文件标识：  
//  内容摘要：  ata 命令相关定义
//  其它说明：  
//  当前版本：  v0.10
//  项    目：  SG9081
//  作    者：  William
//  完成日期：  2015年07月17日 
//   
//  修改记录 1：修改历史记录，包括修改日期、修改者及修改内容 
//  修改日期： 
//  版 本 号： 
//  修 改 人： 
//  修改内容：   
// *****************************************************************************
#ifndef _ATA_GENERAL_H_
#define _ATA_GENERAL_H_

/******************************包含头文件******************************/
#include "sata_typedef.h"

/******************************类型和宏定义******************************/

/******************************变量声明******************************/ 

#ifdef __cplusplus
extern "C" {
#endif 

    // *****************************************************************************
    // 函数名称: ATACmd_Chs2Lba
    // 函数功能: 28bit命令下的CHS to LBA模式转换
    // 入口参数: tpH2d FSM buffer 地址
    // 出口参数: 命令有效性检查状态
    // 说    明: 
    // *****************************************************************************
    CMD_STATUS ATACmd_Chs2Lba(T_H2D *tpH2d);

    void ReceiveDataFromHost(U8 bCmd);
    void ATACmd_ReleaseCommand(CMD_STATUS status);

    // *****************************************************************************
    // 函数名称: ATACmd_RwMultipleExt
    // 函数功能: 子函数 
    // 入口参数: tpH2d FSM buffer 地址
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    CMD_STATUS ATACmd_RwMultipleExt(T_H2D *tpH2d);
    
    // *****************************************************************************
    // 函数名称: ATACmd_RwMultiple
    // 函数功能: 子函数 
    // 入口参数: tpH2d FSM buffer 地址
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    CMD_STATUS ATACmd_RwMultiple(T_H2D *tpH2d);
    
    // *****************************************************************************
    // 函数名称: ATACmd_WriteBuff
    // 函数功能: 实现ATA命令write buff
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ BUFF -E4h, PIO Data-out
    // *****************************************************************************
    void ATACmd_WriteBuff(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_ReadBuff
    // 函数功能: 实现ATA命令READ buff
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ BUFF -E8h, PIO Data-In
    // *****************************************************************************
    void ATACmd_ReadBuff(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_GetCountLba28
    // 函数功能: 通用计算获取28bit 的LBA 和SECTOR size
    // 入口参数: tpH2d FIS 地址
    // 出口参数: 命令有效性检查状态
    // 说    明:
    // *****************************************************************************
    CMD_STATUS ATACmd_GetCountLba28(T_H2D *tpH2d);

    // *****************************************************************************
    // 函数名称: ATACmd_GetCountLba48
    // 函数功能: 通用计算获取48bit 的LBA 和SECTOR size
    // 入口参数: tpH2d H2D FIS地址
    // 出口参数: 命令有效性检查状态
    // 说    明: 
    // *****************************************************************************
    CMD_STATUS ATACmd_GetCountLba48(T_H2D *tpH2d);
    
    // *****************************************************************************
    // 函数名称: ATACmd_LegacyCmdSupport
    // 函数功能: 实现上报ATA历史命令的支持
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void ATACmd_LegacyCmdSupport(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_ExeDevDiagnostic
    // 函数功能: 实现ATA命令 EXECUTE DEVICE DIAGNOSTIC 
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: EXECUTE DEVICE DIAGNOSTIC - 90h
    // *****************************************************************************
    void ATACmd_ExeDevDiagnostic(void);

    // *****************************************************************************
    // 函数名称: ATACmd_Identify
    // 函数功能: 实现ATA命令 IDENTIFY DEVICE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: IDENTIFY DEVICE - ECh, PIO Data-In
    // *****************************************************************************
    void ATACmd_Identify(void );

    // *****************************************************************************
    // 函数名称: ATACmd_FlushCache
    // 函数功能: 实现ATA命令 FLUSH CACHE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: FLUSH CACHE - E7h, Non-Data
    // *****************************************************************************
    void ATACmd_FlushCache(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_ReadVerify
    // 函数功能: 实现ATA命令 ATACmd_ReadVerify
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: FLUSH CACHE - 40/42h, Non-Data
    // *****************************************************************************
    void ATACmd_ReadVerify(void);

    // *****************************************************************************
    // 函数名称: ATACmd_InitDevParam
    // 函数功能: 实现ATA命令 INITIALIZE DEVICE PARAMETERS - 91h, Non-Data - ATA4
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: INITIALIZE DEVICE PARAMETERS - 91h, Non-Data - ATA4
    // *****************************************************************************
    void ATACmd_InitDevParam(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_FlushCacheExt
    // 函数功能: 实现ATA命令 FLUSH CACHE EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: FLUSH CACHE EXT  - EAh, Non-Data
    // *****************************************************************************
    void ATACmd_FlushCacheExt(void);

    // *****************************************************************************
    // 函数名称: ATACmd_SetFeatures
    // 函数功能: 实现ATA命令 SET FEATURES
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: SET FEATURES - EFh, Non-Data
    // *****************************************************************************
    void ATACmd_SetFeatures(void );

    // *****************************************************************************
    // 函数名称: ATACmd_ReadDma
    // 函数功能: 实现ATA命令 READ DMA
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ DMA -C8h, DMA
    // *****************************************************************************
    void ATACmd_ReadDma(void );
    
    // *****************************************************************************
    // 函数名称: ATACmd_WriteBuff
    // 函数功能: 实现ATA命令write buff
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ BUFF -EBh, dma Data-out
    // *****************************************************************************
    void ATACmd_WriteBuffDma(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_ReadBuff
    // 函数功能: 实现ATA命令READ buff
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ BUFF -E9h, dma Data-In
    // *****************************************************************************
    void ATACmd_ReadBuffDma(void);

    // *****************************************************************************
    // 函数名称: ATACmd_WriteDma
    // 函数功能: 实现ATA命令 WRITE DMA
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE DMA- CAh, DMA
    // *****************************************************************************
    void ATACmd_WriteDma(void );

    // *****************************************************************************
    // 函数名称: ATACmd_DataSetManagement
    // 函数功能: 实现ATA命令 DATA SET MANAGEMENT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: DATA SET MANAGEMENT - 06h, DMA
    // *****************************************************************************
    void ATACmd_DataSetManagement(void);

    // *****************************************************************************
    // 函数名称: ATACmd_ReadDma
    // 函数功能: 实现ATA命令 READ DMA
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ DMA -C8h, DMA
    // *****************************************************************************
    void ATACmd_ReadDmaExt(void);

    // *****************************************************************************
    // 函数名称: ATACmd_WriteDmaExt
    // 函数功能: 实现ATA命令 WRITE DMA EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE DMA EXT - 35h, DMA
    // *****************************************************************************
    void ATACmd_WriteDmaExt(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_WriteDmaFuaExt
    // 函数功能: 实现ATA命令 WRITE DMA FUA EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE DMA EXT - 3Dh, DMA
    // *****************************************************************************
    void ATACmd_WriteDmaFuaExt(void);

    // *****************************************************************************
    // 函数名称: ATACmd_SetMultipleMode
    // 函数功能: 实现ATA命令SET MULTIPLE MODE 
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: SET MULTIPLE MODE - C6h, Non-Data
    // *****************************************************************************
    void ATACmd_SetMultipleMode(void);

    // *****************************************************************************
    // 函数名称: ATACmd_ReadMultiple
    // 函数功能: 实现ATA命令READ MULTIPLE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ MULTIPLE -C4h, PIO Data-In
    // *****************************************************************************
    void ATACmd_ReadMultiple(void);

    // *****************************************************************************
    // 函数名称: ATACmd_ReadMultipleExt
    // 函数功能: 实现ATA命令READ MULTIPLE EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: READ MULTIPLE -29h, PIO Data-In
    // *****************************************************************************
    void ATACmd_ReadMultipleExt(void);

    // *****************************************************************************
    // 函数名称: ATACmd_WriteMultiple
    // 函数功能: 实现ATA命令 WRITE MULTIPLE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE MULTIPLE -C5h, PIO Data-Out
    // *****************************************************************************
    void ATACmd_WriteMultiple(void );

    // *****************************************************************************
    // 函数名称: ATACmd_WriteMultipleExt
    // 函数功能: 实现ATA命令 WRITE MULTIPLE EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE MULTIPLE -39h, PIO Data-Out
    // *****************************************************************************
    void ATACmd_WriteMultipleExt(void);

    // *****************************************************************************
    // 函数名称: ATACmd_WriteMultipleFuaExt
    // 函数功能: 实现ATA命令 WRITE MULTIPLE FUA EXT
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: WRITE MULTIPLE -CEh, PIO Data-Out
    // *****************************************************************************
    void ATACmd_WriteMultipleFuaExt(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_PioRdTaskComplete
    // 函数功能: pio读大数据任务分解
    // 入口参数: eStatus:任务完成状态
    //          ptTaskParam：任务相关参数
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void ATACmd_PioRdTaskComplete(CMD_STATUS eStatus,void *ptTaskParam);
    
    // *****************************************************************************
    // 函数名称: ATACmd_PioWrTaskComplete
    // 函数功能: pio写大数据任务分解
    // 入口参数: eStatus:任务完成状态
    //          ptTaskParam：任务相关参数
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void ATACmd_PioWrTaskComplete(CMD_STATUS eStatus,void *ptTaskParam);   
    
    // *****************************************************************************
    // 函数名称: ATACmd_CreatePioTask
    // 函数功能: 首次创建PIO任务
    // 入口参数: eStatus：命令状态
    //           bDir:方向 
    // 出口参数: NONE
    // 说    明: WRITE DMA- CAh, DMA
    // *****************************************************************************
    void ATACmd_CreatePioTask(CMD_STATUS eStatus,U8 bDir);
    
    // *****************************************************************************
    // 函数名称: ATACmd_DmaRwTaskComplete
    // 函数功能: pio写大数据任务完成事件处理
    // 入口参数: eStatus:任务完成状态
    //           ptTaskParam:前一个完成的任务相关参数
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void ATACmd_DmaRwTaskComplete(CMD_STATUS eStatus,void *ptTaskParam);
    
    // *****************************************************************************
    // 函数名称: ATACmd_CreateDmaTask
    // 函数功能: 通用代码
    // 入口参数: eStatus：命令状态
    //           bDir:方向 
    // 出口参数: NONE
    // 说    明: WRITE DMA- CAh, DMA
    // *****************************************************************************
    void ATACmd_CreateDmaTask(CMD_OP eOpcode,CMD_STATUS eStatus,U8 bDir);

	#if 1
    // *****************************************************************************
    // 函数名称: ATACmd_Refuse
    // 函数功能: 对于不支持的ATA命令，回复拒绝访问
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void ATACmd_Refuse(void);
	#endif
    
#ifdef __cplusplus
}
#endif

#endif /*END OF _ATA_GENERAL_H_*/
