// *****************************************************************************
//  版权所有  (C) 2015,  硅格半导体有限公司 
//   
//  文件名称：  SATA_misc.h
//  文件标识：  
//  内容摘要：  miscellaneous :POWERON_COMRESET,IDLE,SRESET,NONE_DATA,相关定义 SATA3.2 :11 Device command layer protocol
//  其它说明：  
//  当前版本：  v0.10
//  项    目：  SG9081
//  作    者：  William
//  完成日期：  2015年07月17日 
//   
//  修改记录 1：修改历史记录，包括修改日期、修改者及修改内容 
//  修改日期： 
//  版 本 号： 
//  修 改 人： 
//  修改内容：   
// *****************************************************************************
#ifndef _SATA_MISC_H_
#define _SATA_MISC_H_
/******************************包含头文件******************************/
#include "dsata.h"
/******************************类型和宏定义******************************/

/******************************变量声明******************************/

/******************************接口定义******************************/
#ifdef __cplusplus
extern "C" {
#endif

    // *****************************************************************************
    // 函数名称: SATA_DevCtx_Init()
    // 函数功能: 协议相关变量初始化
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************    
    void SATA_DevCtx_Init(U8 mode);

    // *****************************************************************************
    // 函数名称: SATA_ComReset_Handler()
    // 函数功能: COMRESET事件中断处理
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_ComReset_Handler(void);
    
    // *****************************************************************************
    // 函数名称: SATA_Non_Fatal_Error_Handler()
    // 函数功能: Non Fatal Error 错误处理
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_Non_Fatal_Error_Handler(void);
    // *****************************************************************************
    // 函数名称: SATA_SendStatus()
    // 函数功能: Fatal Error 错误处理
    // 入口参数: H2D相关的字段
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_SendStatus(U8 bStatus,U8 bError,U8 I);
    // *****************************************************************************
    // 函数名称: SATA_Fatal_Error_Handler()
    // 函数功能: Fatal Error 错误处理
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_Fatal_Error_Handler(void);
    
    // *****************************************************************************
    // 函数名称: SATA_SaveErrorLog()
    // 函数功能: 命令出错以后保存LOG操作
    // 入口参数: 最终发送的D2H的参数
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_SaveErrorLog(U8 bStatus,U8 bError,U8 bI);
    
    // *****************************************************************************
    // 函数名称: SATA_PrdDoneEventHandler()
    // 函数功能: 单次PRD完成中断处理
    // 入口参数: slot
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_PrdDoneEventHandler(U8 bSlot);
    
    // *****************************************************************************
    // 函数名称: SATA_Link_State_Change_Handler()
    // 函数功能: Link_State_Change 错误处理
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_Link_State_Change_Handler(void);
    
    // *****************************************************************************
    // 函数名称: SATA_ClearCmd
    // 函数功能: 出错清除任务管理相关
    // 入口参数: 
    // 出口参数: 
    // 说    明:
    // *****************************************************************************
    void SATA_ClearCmd(void);
    
    // *****************************************************************************
    // 函数名称: SATA_UpdateRdIdx()
    // 函数功能: 更新取任务索引，多个地方会进行该操作所以封装成函数
    // 入口参数: bNum 完成的任务数
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_UpdateRdIdx(U8 bNum);    

    // *****************************************************************************
    // 函数名称: SATA_FTXDS_Handler()
    // 函数功能: SATA传输层数据收发完成中断统一处理接口
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 发现所有数据模块都是一样的操作，可以合并处理
    // *****************************************************************************
    void SATA_FTXDS_Handler(void);

    // *****************************************************************************
    // 函数名称: SATA_SaveH2DFis()
    // 函数功能: 保存有效的FIS
    // 入口参数:  eType 当前传输类型
    // 出口参数: 是否正常保存
    // 说    明: 
    // *****************************************************************************
    BOOL SATA_SaveH2DFis(ENUM_SATA_TRSP_TYPE eType,UN_FSM *unpFsm);

    // *****************************************************************************
    // 函数名称: SATA_ChangeState
    // 函数功能: 切换状态通用接口
    // 入口参数: type切换的传输协议类型，state切换到某一状态
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void SATA_ChangeState(ENUM_SATA_TRSP_TYPE ,U8 );
    // *****************************************************************************
    // 函数名称: SATA_SReset_Handler()
    // 函数功能: Software reset 判断
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    BOOL SATA_SReset_Handler(void);
    // *****************************************************************************
    // 函数名称: SATA_DHR_StateMachine
    // 函数功能: 实现SATA设备命令传输协议中的Power-on and COMRESET protocol 状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: DHR->Device Hardware Reset
    // *****************************************************************************
    void SATA_DHR_StateMachine(void);
    // *****************************************************************************
    // 函数名称: SATA_DHR_IntEventHandler
    // 函数功能: 实现SATA设备命令传输协议中的Power-on and COMRESET protocol状态下中
    //           断响应函数
    // 入口参数: void* 指针，实际使用中会传入SATA设备中断寄存器内容
    // 出口参数: 
    // 说    明: DHR->Device Hardware Reset，此函数工作在中断模式
    // *****************************************************************************
    void SATA_DHR_IntEventHandler(T_PISR *ptPISR);

    // *****************************************************************************
    // 函数名称: SATA_DSR_StateMachine
    // 函数功能: 实现SATA设备命令传输协议中的Software reset protocol 状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: DSR->Device Software Reset
    // *****************************************************************************    
    void SATA_DSR_StateMachine(void);

    // *****************************************************************************
    // 函数名称: SATA_DSR_IntEventHandler
    // 函数功能: 实现SATA设备命令传输协议中的Software reset protocol中断处理函数
    // 入口参数: T_PISR* 指针，实际使用中会传入SATA中断寄存器
    // 出口参数: 
    // 说    明: DSR->Device Software Reset，此函数工作在中断模式
    // *****************************************************************************    
    void SATA_DSR_IntEventHandler(T_PISR *ptPISR);

    // *****************************************************************************
    // 函数名称: SATA_DEDD_StateMachine
    // 函数功能: 实现SATA设备命令传输协议中的EXECUTE DEVICE DIAGNOSTIC command
    //           protocol状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: DEDD->Device Execute Device Diagnostic
    // *****************************************************************************    
    void SATA_DEDD_StateMachine(void);

    // *****************************************************************************
    // 函数名称: SATA_DEDD_IntEventHandler
    // 函数功能: 实现SATA设备命令传输协议中的EXECUTE DEVICE DIAGNOSTIC command
    //           protocol状态机
    // 入口参数: T_PISR* 指针，实际使用中会传入SATA中断寄存器
    // 出口参数: 
    // 说    明: DEDD->Device Execute Device Diagnostic,此函数工作在中断模式
    // *****************************************************************************    
    void SATA_DEDD_IntEventHandler(T_PISR *ptPISR);
#if 0
    // *****************************************************************************
    // 函数名称: SATA_DDR_StateMachine
    // 函数功能: 实现SATA设备命令传输协议中的DEVICE RESET command protocol 状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: DDR->Device Device Reset
    // *****************************************************************************    
    void SATA_DDR_StateMachine(void);

    // *****************************************************************************
    // 函数名称: SATA_DDR_IntEventHandler
    // 函数功能: 实现SATA设备命令传输协议中的DEVICE RESET command protocol中断处理函数
    // 入口参数: T_PISR* 指针，实际使用中会传入SATA中断寄存器
    // 出口参数: 
    // 说    明: DDR->Device Device Reset，此函数工作在中断模式
    // *****************************************************************************    
    void SATA_DDR_IntEventHandler(T_PISR *ptPISR);
#endif
    // *****************************************************************************
    // 函数名称: SATA_DND_StateMachine
    // 函数功能: 实现SATA设备命令传输协议中的Non-data command protocol 状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: DND->Device Non-Data
    // *****************************************************************************    
    void SATA_DND_StateMachine(void);

    // *****************************************************************************
    // 函数名称: SATA_DND_IntEventHandler
    // 函数功能: 实现SATA设备命令传输协议中的Non-data command protocol 状态机
    // 入口参数: T_PISR* 指针，实际使用中会传入SATA中断寄存器
    // 出口参数: 
    // 说    明: DND->Device Non-Data，此函数工作在中断模式
    // *****************************************************************************    
    void SATA_DND_IntEventHandler(T_PISR *ptPISR);
    
    // *****************************************************************************
    // 函数名称: SATA_DND_DataTransferReq
    // 函数功能: non data模式下ATA命令事件或者，FTL事件处理
    // 入口参数: eType:请求类型
    
    // 出口参数: NONE
    // 说    明: DND->Device Non-Data
    // *****************************************************************************
    void SATA_DND_DataTransferReq(REQ_TYPE eType,T_HI_TASK *ptTask,TransferCompleteCb_t *pfTransferCompleteCb);

#ifdef __cplusplus
}
#endif
#endif/*_SATA_MISC_H_*/
