#ifndef _TASK_PROCESS_H_
#define _TASK_PROCESS_H_

/******************************包头文件******************************/
#include "sata_typedef.h"

/******************************类型和宏定义******************************/
#ifndef MAX_CMD_NUM
#define MAX_CMD_NUM    (32U)
#endif

//TPM:Task Process Module
/******************************变量声明******************************/

/******************************接口定义******************************/
#ifdef __cplusplus
extern "C" {
#endif
    // *****************************************************************************
    // 函数名称: TPM_Init
    // 函数功能: FTL初始化函数
    // 入口参数: NONE
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void  TPM_Init(void);    
    // *****************************************************************************
    // 函数名称: TQM_StateMachine
    // 函数功能: FTL 任务管理模块状态机
    // 入口参数: 
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************    
    void TPM_StateMachine(void);
    void TaskQueuedEventDefaultHandle (T_TASK_QUEUE_CTX *queue);
    
    // *****************************************************************************
    // 函数名称: TPM_ParseTask
    // 函数功能: FTL 任务解析接口
    // 入口参数: 
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void TPM_ParseTask(void);
    
    // *****************************************************************************
    // 函数名称: TPM_IntEvent2Sata
    // 函数功能: 通知SATA层FTL事务完结，发送中断给SATA
    // 入口参数: 完成的任务槽号
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void TPM_IntEvent2Sata(U8 bSlot);
    
    // *****************************************************************************
    // 函数名称: TPM_IntEventFromSata
    // 函数功能: SATA中断事件处理接口
    // 入口参数: 
    // 出口参数: 
    // 说    明: 
    // *****************************************************************************
    void TPM_IntEventFromSata(void);
    // *****************************************************************************
    // 函数名称: TPM_SyncEventFromSata
    // 函数功能: SATA 同步事件处理接口,可延迟处理的事件
    // 入口参数:
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void TPM_SyncEventFromSata(void);

    // *****************************************************************************
    // 函数名称: TPM_AsyncEventFromSata
    // 函数功能: SATA 异步事件处理接口,可延迟处理的事件
    // 入口参数:
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void TPM_AsyncEventFromSata(void);
    // *****************************************************************************
    // 函数名称: __getlock
    // 函数功能: 获取操作锁
    // 入口参数:
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void __getlock(void);

    // *****************************************************************************
    // 函数名称: __wait4unlocked
    // 函数功能: 等待解锁
    // 入口参数:
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    BOOL __wait4unlocked(void);


    // *****************************************************************************
    // 函数名称: __unlock
    // 函数功能: 解操作锁
    // 入口参数:
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void __unlock(void);

    // *****************************************************************************
    // 函数名称: EXTA_INT0_IRQHandler
    // 函数功能: 外部中断0服务函数，处理SATA模块异常事务相关事件
    // 入口参数: NONE
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void SF0_INT0_IRQHandler(void);
    // *****************************************************************************
    // 函数名称: EXTA_INT1_IRQHandler
    // 函数功能: 外部中断1服务函数，处理SATA模块添加数据相关任务事件
    // 入口参数: NONE
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void SF0_INT1_IRQHandler(void);

#ifdef __cplusplus
}
#endif

#endif /*END OF _TASK_PROCESS_H_*/
