#ifndef _TASK_MANAGEG_H_
#define _TASK_MANAGEG_H_

/******************************包头文件******************************/
#include "sg9081.h"
#include "task_process.h"

/******************************类型和宏定义******************************/
#ifndef MAX_CMD_NUM
#define MAX_CMD_NUM     (32U)
#endif 
#define DI_CMD_SLOTNUM  (32) //Device Init的任务号

typedef enum
{
    RET_OK=0,
    RET_CMD_EMPTY,
    RET_CMD_OVERFLOW,
    RET_INVALID_PARAM,
}RET_STATUS;

//TQM:TASK QUEUE MANAGE 

/******************************变量声明******************************/

/******************************接口定义******************************/
#ifdef __cplusplus
extern "C" {
#endif 

    // *****************************************************************************
    // 函数名称: TQM_Init
    // 函数功能: 任务队列管理模块初始化函数
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void  TQM_Init();
    
    // *****************************************************************************
    // 函数名称: TQM_CreateTask
    // 函数功能: 创建任务
    // 入口参数: eOpcode:任务类型
    //             bTag:任务号
    //             pfTaskCompleteCb:事务完成回调函数
    // 出口参数: 任务是否创建成功
    // 说    明: 
    // *****************************************************************************
    BOOL TQM_CreateTask(CMD_OP eOpcode,T_HI_TASK *ptTask,TaskCompleteCb_t *pfTaskCompleteCb);

    // *****************************************************************************
    // 函数名称: TQM_AddTask
    // 函数功能: 任务队列管理模块添加新任务到任务列表并更新列表相关内部管理信息的模块
    //           内部接口
    // 入口参数: ptTask 任务指针
    // 出口参数:
    // 说    明: 
    // *****************************************************************************
    void  TQM_AddTask(T_HI_TASK *ptTask);
    
    // *****************************************************************************
    // 函数名称: TQM_AbortAllTask
    // 函数功能: SATA接口出错，终止任务队列
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void  TQM_AbortAllTask(void);
    
    // *****************************************************************************
    // 函数名称: TQM_GetTask
    // 函数功能: 任务队列管理模块，FTL获取正在进行的任务
    // 入口参数: bSlot :任务号
    // 出口参数: T_HI_TASK* ：返回有效的任务指针，没有任务则返回NULL
    // 说    明: 
    // *****************************************************************************
    T_HI_TASK*  TQM_GetTask(U8 bSlot);
        
    // *****************************************************************************
    // 函数名称: TQM_RemoveTask
    // 函数功能: 任务队列管理接口，FTL完成任务以后更新任务完成状态
    // 入口参数: bSlot:完成任务的SLOT 
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void  TQM_RemoveTask(U8 bSlot);

    // *****************************************************************************
    // 函数名称: TQM_RemoveMulTask
    // 函数功能: 任务队列管理接口，FTL完成任务以后更新多任务完成状态
    // 入口参数: bSlot:完成任务的SLOT
    // 出口参数: NONE
    // 说    明:
    // *****************************************************************************
    void  TQM_RemoveMulTask(U32 mask);
    void TQM_CheckDiTaskDone(void);

    // *****************************************************************************
    // 函数名称: TQM_HiTaskDoneEventHandler
    // 函数功能: 事务处理完成中断
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: 
    // *****************************************************************************
    void  TQM_HiTaskDoneEventHandler(U8 bSlot);
    // *****************************************************************************
    // 函数名称: EXTB_INT0_IRQHandler
    // 函数功能: 外部中断0服务函数，处理FTL触发的异常事务完成事件
    // 入口参数: NONE
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void SF1_INT0_IRQHandler(void);
    
    // *****************************************************************************
    // 函数名称: EXTA_INT1_IRQHandler
    // 函数功能: 外部中断1服务函数,处理FTL触发的数据相关事务完成事件
    // 入口参数: NONE
    // 出口参数:
    // 说    明:
    // *****************************************************************************
    void SF1_INT1_IRQHandler(void);

#ifdef __cplusplus
}
#endif



#endif /*END OF _TASK_MANAGEG_H_*/
