// *****************************************************************************
//  版权所有  (C) 2015,  硅格半导体有限公司 
//   
//  文件名称：  ata_power_mg.h
//  文件标识：  
//  内容摘要：  ata power manage 命令相关定义
//  其它说明：  
//  当前版本：  v0.10
//  项    目：  SG9081
//  作    者：  William
//  完成日期：  2015年07月17日 
//   
//  修改记录 1：修改历史记录，包括修改日期、修改者及修改内容 
//  修改日期： 
//  版 本 号： 

//  修 改 人： 
//  修改内容：   
// *****************************************************************************
#ifndef _ATA_POWER_MG_H_
#define _ATA_POWER_MG_H_
/******************************包含头文件******************************/

/******************************类型和宏定义******************************/

/******************************变量声明******************************/

/******************************接口定义******************************/
#ifdef __cplusplus
extern "C" {
#endif

//TODO:ata_power_mg关命令接口声明
    
    // *****************************************************************************
    // 函数名称: ATACmd_CheckPowerMode
    // 函数功能: 实现ATA命令 CHECK POWER MODE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: CHECK POWER MODE – E5h, Non-Data
    // *****************************************************************************
    void ATACmd_CheckPowerMode(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_Idle
    // 函数功能: 实现ATA命令 IDLE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: IDLE – E3h, Non-Data
    // *****************************************************************************
    void ATACmd_Idle(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_IdleImmediate
    // 函数功能: 实现ATA命令 IDLE IMMEDIATE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明:  IDLE IMMEDIATE – E1h, Non-Data
    // *****************************************************************************
    void ATACmd_IdleImmediate(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_Sleep
    // 函数功能: 实现ATA命令 SLEEP
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: E6h, Non-Data
    // *****************************************************************************
    void ATACmd_Sleep(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_Standby
    // 函数功能: 实现ATA命令 STANBY
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: STANDBY – E2h, Non-Data
    // *****************************************************************************
    void ATACmd_Standby(void);
    
    // *****************************************************************************
    // 函数名称: ATACmd_StandbyImmediate
    // 函数功能: 实现ATA命令 STANBY IMMEDIATE
    // 入口参数: NONE
    // 出口参数: NONE
    // 说    明: STANDBY IMMEDIATE – E0h, Non-Data
    // *****************************************************************************
    void ATACmd_StandbyImmediate(void);
    

#ifdef __cplusplus
}
#endif
#endif/*_ATA_POWER_MG_H_*/



